vignettes/empirical-studies.org
#+TITLE: Estimation of average treatment effect wit generalized random forest in censored data: Proof of concept 
#+Author: Helene Charlotte Wiese Rytgaard & Thomas Alexander Gerds
#+Date: 
#+EMAIL: tag@biostat.ku.dk
#+LANGUAGE:  en
#+OPTIONS: H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc author:nil
#+LaTeX_CLASS: org-article
#+LaTeX_HEADER:\usepackage{authblk}
#+LaTeX_HEADER:\usepackage{natbib}
#+LaTeX_HEADER:\usepackage[table,usenames,dvipsnames]{xcolor}
#+LaTeX_HEADER:\definecolor{lightGray}{gray}{0.98}
#+LaTeX_HEADER:\definecolor{medioGray}{gray}{0.83}
#+LaTeX_HEADER:\author{Thomas Alexander Gerds}
#+LaTeX_HEADER:\affil{Department of Biostatistics, University of Copenhagen}
#+setupfile:~/emacs-genome/snps/org-templates/setup-all-purpose.org
#+superman-export-target: html
* Intro

We test our two-stage estimator.
  
* Data generating model

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  
library(lava)
library(Publish)
library(riskRegression)
library(prodlim)
library(prodlim)
library(survival)
library(data.table)
library(grf)
library(ranger)
if (system("echo $USER",intern=TRUE)=="tag")
  setwd("~/research/SoftWare/grfCausalSearch/vignettes/")
else
  setwd("~princess-hely/grfCausalSearch/vignettes/")
source("../R/grfcens.R")
m <- lvm(~A+X1+X2+X3+X4+X5)
# treatment variable
distribution(m,~A) <- binomial.lvm()
# latent outcome variables
distribution(m,~latenttime1) <- coxWeibull.lvm()
distribution(m,~latenttime2) <- coxWeibull.lvm()
distribution(m,~censtime) <- coxWeibull.lvm(scale=1/25)
# observed outcome
m <- eventTime(m,time~min(latenttime1=1,latenttime2=2,censtime=0),"event")
# dependencies: log-odds ratios and log-hazard ratios
# no effect of A on latenttime1
# regression(m,A~X1+X2+X3+X4+X5) <- c(.1,-.3,.8,-.1,0)
regression(m,A~X1+X2+X3+X4+X5) <- c(.1,-.3,.2,-.1,0)
regression(m,latenttime1~A+X1+X2+X3+X4+X5) <- c(0,.1,-.3,.8,-.1,0)
regression(m,latenttime2~A+X1+X2+X3+X4+X5) <- c(0.2,0,-.3,-.8,-.1,.5)
# no effect of any variable on censoring distribution
gammaA <- gamma1 <- gamma2 <- gamma3 <- gamma4 <- gamma5  <- 0
regression(m,censtime~A+X1+X2+X3+X4+X5) <- c(gammaA,gamma1,gamma2,gamma3,gamma4,gamma5)
## d <- sim(m,1000)
## setDT(d)[,mean(time<7&event==0)]
m
#+END_SRC

#+RESULTS[<2020-06-10 13:38:24> 1e2c957538283269dee53fede01c3597bcfaae1f]:
#+begin_example
Error: unexpected 'else' in "else"
Error in setwd("~princess-hely/grfCausalSearch/vignettes/") : 
  cannot change working directory
Event History Model
                                                                 
 A ~ X1+X2+X3+X4                                 binomial(logit) 
 X1 ~ 1                                          Normal          
 X2 ~ 1                                          Normal          
 X3 ~ 1                                          Normal          
 X4 ~ 1                                          Normal          
 X5 ~ 1                                          Normal          
 latenttime1 ~ X1+X2+X3+X4                       weibull(2,0.01) 
 latenttime2 ~ A+X2+X3+X4+X5                     weibull(2,0.01) 
 censtime ~ 1                                    weibull(2,0.01) 
 time = min(latenttime1,latenttime2,censtime)    event := {1,2,0}

Latent Variable Model
                                               
  A ~ X1+X2+X3+X4               binomial(logit)
  latenttime1 ~ X1+X2+X3+X4     weibull(2,0.01)
  latenttime2 ~ A+X2+X3+X4+X5   weibull(2,0.01)
  censtime ~ 1                  weibull(2,0.01)
  time ~ 1                      deterministic  
  event ~ 1                     deterministic  

Exogenous variables:                    
  X1        gaussian
  X2        gaussian
  X3        gaussian
  X4        gaussian
  X5        gaussian
#+end_example

* Uncensored data

** One repetition

*** No effect

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  
set.seed(498)
regression(m,latenttime1~A) <- 0
d <- setDT(sim(m,500))
d[,dummy:=1]
d[,A:=factor(A)]
fit1 <- grfcens(formula=Hist(latenttime1,dummy)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
#+END_SRC

#+RESULTS[<2020-06-10 13:50:47> 79732a5b08b1963cd94cd727bec9a0ba245bd439]:
:         ate          se       lower       upper 
:  0.01834816  0.04165494 -0.06329402  0.09999035

*** Positive effect

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  
set.seed(498)
regression(m,latenttime1~A) <- 1
d <- setDT(sim(m,500))
d[,dummy:=1]
d[,A:=factor(A)]
fit1 <- grfcens(formula=Hist(latenttime1,dummy)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
#+END_SRC

#+RESULTS[<2020-06-10 13:45:26> 9261ec36bc192861d81606aae6fa8c0e91b5113d]:
:        ate         se      lower      upper 
: 0.32978047 0.03897086 0.25339899 0.40616195

*** Negative effect

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  
set.seed(498)
regression(m,latenttime1~A) <- -1
d <- setDT(sim(m,500))
d[,dummy:=1]
d[,A:=factor(A)]
fit1 <- grfcens(formula=Hist(latenttime1,dummy)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
#+END_SRC

#+RESULTS[<2020-06-10 13:45:40> 151c646b5af240b3a5895ba4acde6f89a26f3106]:
:         ate          se       lower       upper 
: -0.24055401  0.03676123 -0.31260470 -0.16850331

** Small Simulation Study

