vignettes/empirical-studies.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-10 Wed 15:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Estimation of average treatment effect wit generalized random forest in censored data: Proof of concept</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Helene Charlotte Wiese Rytgaard &amp; Thomas Alexander Gerds" />
<link rel="stylesheet" type="text/css" href="https://publicifsv.sund.ku.dk/~tag/styles/all-purpose.css" />
</head>
<body>
<div id="preamble" class="status">
<br>Helene Charlotte Wiese Rytgaard &amp; Thomas Alexander Gerds
</div>
<div id="content">
<h1 class="title">Estimation of average treatment effect wit generalized random forest in censored data: Proof of concept</h1>
<div id="outline-container-org9c1ad6e" class="outline-2">
<h2 id="org9c1ad6e">Intro</h2>
<div class="outline-text-2" id="text-org9c1ad6e">
<p>
We test our two-stage estimator.
</p>
</div>
</div>

<div id="outline-container-org868f684" class="outline-2">
<h2 id="org868f684">Data generating model</h2>
<div class="outline-text-2" id="text-org868f684">
<div class="org-src-container">
<pre class="src src-R"><span style="font-weight: bold; text-decoration: underline;">library</span>(lava)
<span style="font-weight: bold; text-decoration: underline;">library</span>(Publish)
<span style="font-weight: bold; text-decoration: underline;">library</span>(riskRegression)
<span style="font-weight: bold; text-decoration: underline;">library</span>(prodlim)
<span style="font-weight: bold; text-decoration: underline;">library</span>(prodlim)
<span style="font-weight: bold; text-decoration: underline;">library</span>(survival)
<span style="font-weight: bold; text-decoration: underline;">library</span>(data.table)
<span style="font-weight: bold; text-decoration: underline;">library</span>(grf)
<span style="font-weight: bold; text-decoration: underline;">library</span>(ranger)
<span style="font-weight: bold;">if</span> (system(<span style="font-style: italic;">"echo $USER"</span>,intern=<span style="font-weight: bold; text-decoration: underline;">TRUE</span>)==<span style="font-style: italic;">"tag"</span>)
  <span style="font-weight: bold; text-decoration: underline;">setwd</span>(<span style="font-style: italic;">"~/research/SoftWare/grfCausalSearch/vignettes/"</span>)
<span style="font-weight: bold;">else</span>
  <span style="font-weight: bold; text-decoration: underline;">setwd</span>(<span style="font-style: italic;">"~princess-hely/grfCausalSearch/vignettes/"</span>)
<span style="font-weight: bold; text-decoration: underline;">source</span>(<span style="font-style: italic;">"../R/grfcens.R"</span>)
m <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> lvm(~A+X1+X2+X3+X4+X5)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">treatment variable</span>
distribution(m,~A) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> binomial.lvm()
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">latent outcome variables</span>
distribution(m,~latenttime1) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> coxWeibull.lvm()
distribution(m,~latenttime2) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> coxWeibull.lvm()
distribution(m,~censtime) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> coxWeibull.lvm(scale=1/25)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">observed outcome</span>
m <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> eventTime(m,time~min(latenttime1=1,latenttime2=2,censtime=0),<span style="font-style: italic;">"event"</span>)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">dependencies: log-odds ratios and log-hazard ratios</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">no effect of A on latenttime1</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">regression(m,A~X1+X2+X3+X4+X5) &lt;- c(.1,-.3,.8,-.1,0)</span>
regression(m,A~X1+X2+X3+X4+X5) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(.1,-.3,.2,-.1,0)
regression(m,latenttime1~A+X1+X2+X3+X4+X5) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(0,.1,-.3,.8,-.1,0)
regression(m,latenttime2~A+X1+X2+X3+X4+X5) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(0.2,0,-.3,-.8,-.1,.5)
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">no effect of any variable on censoring distribution</span>
gammaA <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> gamma1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> gamma2 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> gamma3 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> gamma4 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> gamma5  <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> 0
regression(m,censtime~A+X1+X2+X3+X4+X5) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(gammaA,gamma1,gamma2,gamma3,gamma4,gamma5)
<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">d &lt;- sim(m,1000)</span>
<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">setDT(d)[,mean(time&lt;7&amp;event==0)]</span>
m
</pre>
</div>

<pre class="example">
Error: unexpected 'else' in "else"
Error in setwd("~princess-hely/grfCausalSearch/vignettes/") : 
  cannot change working directory
Event History Model
                                                                 
 A ~ X1+X2+X3+X4                                 binomial(logit) 
 X1 ~ 1                                          Normal          
 X2 ~ 1                                          Normal          
 X3 ~ 1                                          Normal          
 X4 ~ 1                                          Normal          
 X5 ~ 1                                          Normal          
 latenttime1 ~ X1+X2+X3+X4                       weibull(2,0.01) 
 latenttime2 ~ A+X2+X3+X4+X5                     weibull(2,0.01) 
 censtime ~ 1                                    weibull(2,0.01) 
 time = min(latenttime1,latenttime2,censtime)    event := {1,2,0}

Latent Variable Model
                                               
  A ~ X1+X2+X3+X4               binomial(logit)
  latenttime1 ~ X1+X2+X3+X4     weibull(2,0.01)
  latenttime2 ~ A+X2+X3+X4+X5   weibull(2,0.01)
  censtime ~ 1                  weibull(2,0.01)
  time ~ 1                      deterministic  
  event ~ 1                     deterministic  

Exogenous variables:                    
  X1        gaussian
  X2        gaussian
  X3        gaussian
  X4        gaussian
  X5        gaussian
</pre>
</div>
</div>

<div id="outline-container-orgf62ea26" class="outline-2">
<h2 id="orgf62ea26">Uncensored data</h2>
<div class="outline-text-2" id="text-orgf62ea26">
</div>
<div id="outline-container-org4d01b72" class="outline-3">
<h3 id="org4d01b72">One repetition</h3>
<div class="outline-text-3" id="text-org4d01b72">
</div>
<div id="outline-container-org15f9b0a" class="outline-4">
<h4 id="org15f9b0a">No effect</h4>
<div class="outline-text-4" id="text-org15f9b0a">
<div class="org-src-container">
<pre class="src src-R">set.seed(498)
regression(m,latenttime1~A) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> 0
d <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> setDT(sim(m,500))
d[,dummy:=1]
d[,A:=factor(A)]
fit1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(latenttime1,dummy)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
</pre>
</div>

<pre class="example">
       ate          se       lower       upper 
0.01834816  0.04165494 -0.06329402  0.09999035
</pre>
</div>
</div>

<div id="outline-container-org0c6ef9c" class="outline-4">
<h4 id="org0c6ef9c">Positive effect</h4>
<div class="outline-text-4" id="text-org0c6ef9c">
<div class="org-src-container">
<pre class="src src-R">set.seed(498)
regression(m,latenttime1~A) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> 1
d <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> setDT(sim(m,500))
d[,dummy:=1]
d[,A:=factor(A)]
fit1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(latenttime1,dummy)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
</pre>
</div>

<pre class="example">
       ate         se      lower      upper 
0.32978047 0.03897086 0.25339899 0.40616195
</pre>
</div>
</div>

<div id="outline-container-orgb61aadc" class="outline-4">
<h4 id="orgb61aadc">Negative effect</h4>
<div class="outline-text-4" id="text-orgb61aadc">
<div class="org-src-container">
<pre class="src src-R">set.seed(498)
regression(m,latenttime1~A) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> -1
d <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> setDT(sim(m,500))
d[,dummy:=1]
d[,A:=factor(A)]
fit1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(latenttime1,dummy)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
</pre>
</div>

<pre class="example">
        ate          se       lower       upper 
-0.24055401  0.03676123 -0.31260470 -0.16850331
</pre>
</div>
</div>
</div>
