vignettes/empirical-studies.org
*** No effect

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output :exports both  :session *R* :cache yes  
## regression(m,A~X1+X2+X3+X4+X5) <- c(.1,-.3,.8,-.1,0)
m1 <- m
regression(m1,latenttime1~A) <- 0
run <- function(...,N,timeinterest){
  dat <- as.data.table(lava::sim(m1,n = N))
  dat[,dummy:=1]
  out <- grfcens(formula=Hist(latenttime1,dummy)~intervene(A)+X1+X2+X3+X4+X5,data=dat,times=7)
  out
}
# undebug(run)
x <- sim(run,30,mc.cores=3,timeinterest=7,N=200)
x
#+END_SRC

#+RESULTS[<2020-06-10 13:47:21> b7e11ce2e169465b04c209b8e5eb6a01ef9ca261]:
#+begin_example
    ate       se        lower     upper    
1   -0.04046   0.06375  -0.16540   0.08448 
2   -0.03707   0.06769  -0.16973   0.09560 
3   -0.03036   0.06650  -0.16070   0.09999 
4   -0.03355   0.06529  -0.16151   0.09441 
5   -0.09749   0.06473  -0.22437   0.02938 
---                                        
26  -0.022802  0.064192 -0.148615  0.103011
27  -0.010145  0.065534 -0.138589  0.118298
28  -0.065567  0.064589 -0.192160  0.061026
29   0.053550  0.061210 -0.066420  0.173520
30  -0.008848  0.065875 -0.137960  0.120263

           ate       se     lower    upper
Mean -0.005950 0.065677 -0.134675 0.122775
SD    0.048841 0.001943  0.050172 0.047777
#+end_example

* Censored data

** One repetition

*** No effect

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  
set.seed(499)
regression(m,latenttime1~A) <- 0
d <- setDT(sim(m,500))
Fit1 <- grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
Fit1
#+END_SRC

#+RESULTS[<2020-06-10 14:07:08> f7d846a5751b28c4c97296525046673cf31558c4]:
:          ate           se        lower        upper 
: -0.004082882  0.072116126 -0.145427891  0.137262128

*** Positive effect

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  
set.seed(498)
regression(m,latenttime1~A) <- 1
d <- setDT(sim(m,500))
fit1 <- grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
#+END_SRC

#+RESULTS[<2020-06-10 13:51:23> ad241153ca50adaed2a6b8437050c3977dc896f4]:
:        ate         se      lower      upper 
: 0.21554009 0.08553303 0.04789842 0.38318175

*** Negative effect

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  
set.seed(498)
regression(m,latenttime1~A) <- -1
d <- setDT(sim(m,500))
fit1 <- grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
#+END_SRC

#+RESULTS[<2020-06-10 13:51:35> b99541456c92030d580c42f0620140ba5874e317]:
:         ate          se       lower       upper 
: -0.22301823  0.07118216 -0.36253270 -0.08350376

*** No effect of A and but effect on censoring
#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  
m1 <- m
regression(m1,latenttime1~A+X1+X2+X3+X4+X5) <- c(0,.1,-.3,.1,-.4,1.5)
regression(m1,censtime~A+X1+X2+X3+X4+X5) <- c(1,.1,-.3,-.1,-.3,-1)
regression(m1,A~X1+X2+X3+X4+X5) <- c(.1,-.3,.4,-.1,-1.5)
test <- sim(m1,1000)
par(mfrow=c(1,2))
plot(prodlim(Hist(time,event)~A,data=test),atrisk.at=c(0,1,3,5),xlim=c(0,5))
plot(prodlim(Hist(time,event)~X5,data=test,reverse=TRUE),atrisk.at=c(0,1,3,5),xlim=c(0,5))
d <- setDT(sim(m1,500))
KM <- grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=3,method.weight="km",formula.weight=Hist(time,event)~1)
forest <- grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=3,args.weight=list(num.tree=500))
out <- rbind(KM,forest)
out
#+END_SRC

#+RESULTS[<2020-06-10 15:14:13> 924fce6bc87fe9ec0cbef5b328d5f9d56389c461]:
:                ate         se       lower      upper
: KM     -0.04442005 0.04407674 -0.13080886 0.04196876
: forest -0.02749319 0.03465343 -0.09541266 0.04042628




** Small Simulation Study

