vignettes/empirical-studies.html

<div id="outline-container-orga6f8beb" class="outline-3">
<h3 id="orga6f8beb">Small Simulation Study</h3>
<div class="outline-text-3" id="text-orga6f8beb">
</div>
<div id="outline-container-org7495321" class="outline-4">
<h4 id="org7495321">No effect</h4>
<div class="outline-text-4" id="text-org7495321">
<div class="org-src-container">
<pre class="src src-R"><span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">regression(m,A~X1+X2+X3+X4+X5) &lt;- c(.1,-.3,.8,-.1,0)</span>
m1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> m
regression(m1,latenttime1~A) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> 0
<span style="font-weight: bold;">run</span> <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> <span style="font-weight: bold;">function</span>(...,N,timeinterest){
  dat <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> as.data.table(lava::sim(m1,n = N))
  dat[,dummy:=1]
  out <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(latenttime1,dummy)~intervene(A)+X1+X2+X3+X4+X5,data=dat,times=7)
  out
}
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">undebug(run)</span>
x <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> sim(run,30,mc.cores=3,timeinterest=7,N=200)
x
</pre>
</div>

<pre class="example">
    ate       se        lower     upper    
1   -0.04046   0.06375  -0.16540   0.08448 
2   -0.03707   0.06769  -0.16973   0.09560 
3   -0.03036   0.06650  -0.16070   0.09999 
4   -0.03355   0.06529  -0.16151   0.09441 
5   -0.09749   0.06473  -0.22437   0.02938 
---                                        
26  -0.022802  0.064192 -0.148615  0.103011
27  -0.010145  0.065534 -0.138589  0.118298
28  -0.065567  0.064589 -0.192160  0.061026
29   0.053550  0.061210 -0.066420  0.173520
30  -0.008848  0.065875 -0.137960  0.120263

           ate       se     lower    upper
Mean -0.005950 0.065677 -0.134675 0.122775
SD    0.048841 0.001943  0.050172 0.047777
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org766b6ce" class="outline-2">
<h2 id="org766b6ce">Censored data</h2>
<div class="outline-text-2" id="text-org766b6ce">
</div>
<div id="outline-container-org464a2b4" class="outline-3">
<h3 id="org464a2b4">One repetition</h3>
<div class="outline-text-3" id="text-org464a2b4">
</div>
<div id="outline-container-orge19db51" class="outline-4">
<h4 id="orge19db51">No effect</h4>
<div class="outline-text-4" id="text-orge19db51">
<div class="org-src-container">
<pre class="src src-R">set.seed(499)
regression(m,latenttime1~A) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> 0
d <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> setDT(sim(m,500))
Fit1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
Fit1
</pre>
</div>

<pre class="example">
         ate           se        lower        upper 
-0.004082882  0.072116126 -0.145427891  0.137262128
</pre>
</div>
</div>

<div id="outline-container-org3d4005a" class="outline-4">
<h4 id="org3d4005a">Positive effect</h4>
<div class="outline-text-4" id="text-org3d4005a">
<div class="org-src-container">
<pre class="src src-R">set.seed(498)
regression(m,latenttime1~A) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> 1
d <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> setDT(sim(m,500))
fit1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
</pre>
</div>

<pre class="example">
       ate         se      lower      upper 
0.21554009 0.08553303 0.04789842 0.38318175
</pre>
</div>
</div>

<div id="outline-container-org5c87206" class="outline-4">
<h4 id="org5c87206">Negative effect</h4>
<div class="outline-text-4" id="text-org5c87206">
<div class="org-src-container">
<pre class="src src-R">set.seed(498)
regression(m,latenttime1~A) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> -1
d <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> setDT(sim(m,500))
fit1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=7)
fit1
</pre>
</div>

<pre class="example">
        ate          se       lower       upper 
-0.22301823  0.07118216 -0.36253270 -0.08350376
</pre>
</div>
</div>

<div id="outline-container-org338d6c9" class="outline-4">
<h4 id="org338d6c9">No effect of A and but effect on censoring</h4>
<div class="outline-text-4" id="text-org338d6c9">
<div class="org-src-container">
<pre class="src src-R">m1 <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> m
regression(m1,latenttime1~A+X1+X2+X3+X4+X5) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(0,.1,-.3,.1,-.4,1.5)
regression(m1,censtime~A+X1+X2+X3+X4+X5) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(1,.1,-.3,-.1,-.3,-1)
regression(m1,A~X1+X2+X3+X4+X5) <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> c(.1,-.3,.4,-.1,-1.5)
test <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> sim(m1,1000)
<span style="font-weight: bold; text-decoration: underline;">par</span>(mfrow=c(1,2))
plot(prodlim(Hist(time,event)~A,data=test),atrisk.at=c(0,1,3,5),xlim=c(0,5))
plot(prodlim(Hist(time,event)~X5,data=test,reverse=<span style="font-weight: bold; text-decoration: underline;">TRUE</span>),atrisk.at=c(0,1,3,5),xlim=c(0,5))
d <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> setDT(sim(m1,500))
KM <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=3,method.weight=<span style="font-style: italic;">"km"</span>,formula.weight=Hist(time,event)~1)
forest <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> grfcens(formula=Hist(time,event)~intervene(A)+X1+X2+X3+X4+X5,data=d,times=3,args.weight=list(num.tree=500))
out <span style="font-weight: bold; text-decoration: underline;">&lt;-</span> rbind(KM,forest)
out
</pre>
</div>

<pre class="example">
               ate         se       lower      upper
KM     -0.04442005 0.04407674 -0.13080886 0.04196876
forest -0.02749319 0.03465343 -0.09541266 0.04042628
</pre>
</div>
</div>
</div>
